package com.example.sd;

public class Question {


    public static String question[] = {
            "다음 중 다익스트라(Dijkstra) 알고리즘을 사용하는 라우팅 프로토콜에 대한 설명 중 올바르지 않은 것은?",
            "원자력, 전기, 철강, 반도체, 화학 등 주요 산업 기반 시설의 제어 시스템에 침투해서 오작동을 일으키는 악성코드 공격기법은 무엇인가",
            "다음 중 스크럼 기법 중에서 남아있는 백로그 대비 시간을 그래프적으로 표현한 차트는 무엇인가?",
            "다음 중 8개의 정점으로 구성된 무방향 그래프의 최대 간선 수는?",
            "테스트의 실행결과가 올바른 결과인지 판단하는 매커니즘은?",
            "시간의 흐름에 따라 객체들 사이의 제어흐름, 동작 순서 등을 표현하고 상태 다이어그램을 활용하여 표현하는 모델링은?",
            "제 2정규형에서 제 3정규형이 되기 위한 조건은?",
            "다음 중 테이블 관련 용어에 대한 설명으로 올바르지 않은 것은?"
    };

    public static String answers[][] = {
            {"대규모 망에 적합한 알고리즘이다.", "거리벡터 알고리즘이다.", "OSPF에서 사용된다.", "링크상태 알고리즘이다."},
            {"리버스 쉘 공격", "크리덴셜 스터핑", "스턱스넷 공격", "스캠 공격"},
            {"스프린트", "번 다운 차트", "스프린트 회고", "칸반보드"},
            {"18", "22", "26", "28"},
            {"테스트 하네스", "테스트 오라클", "테스트 종료 기준", "워크스루"},
            {"Object Modeling","Dynamic Modeling","Functional Modeling","Relation Modeling"},
            {"결정자가 후보키가 아닌 함수 종속 제거","이행적 함수 종속제거","부분적 함수 종속 제거","원자값이 아닌 도메인 분해"},
            {"튜플은 열을 의미하고 튜플의 개수는 Degree라고 한다.","튜플은 릴레이션에서 같은값을 가질 수 없다","차수는 애트리뷰트의 개수이다","도메인은 하나의 애트리뷰트가 취할 수 있는 같은 타입의 원자값 들의 집합이다."}

    };

    public static String correct[] = {
            "거리벡터 알고리즘이다.",
            "스턱스넷 공격",
            "번 다운 차트",
            "28",
            "테스트 오라클",
            "Dynamic Modeling",
            "이행적 함수 종속제거",
            "튜플은 열을 의미하고 튜플의 개수는 Degree라고 한다."
    };
}
